In [ ]:
import pandas as pd
dictionary = {"first" : pd.Series([10,20,30,40,50],["urdu","eng","phy","isl","chem"]),
             "second" : pd.Series([60,20,70,80,50],["science","math","phy","isl","pf"])}
d = pd.DataFrame(dictionary)
d

In [ ]:
print("the index of the all dictionary = ",d.index)
# print("the columns in the dictionary = ",d.columns)
print("print the value to this index",pd.DataFrame(d,index = ["science","phy","chem"]))     #to find the value at perticular index
pd.DataFrame(d,index = ["eng" , "Urdu" , "isl"] , columns = ["first", "second" , "four"]) #es main check kry ga ga k urdu , eng  , isl ky first , second ya fourth column main sy kisi main ha to print kr dy ga

In [ ]:
#Arithmetic operations
d["third"] =d["first"]+d["second"] 
d
d["third"] =d["first"]-d["second"] 
print("substraction = ",d)
d["third"] =d["first"]*d["second"] 
print("multiplication = ",d)
d["third"] =d["first"]/d["second"]
d       #jab hum begair print likhy print krwain gy to tab he esy pyara sa print kry ga

In [ ]:
#insert Function
d.insert(2,"fifth",d["first"])      #yeh wala function index 2 waly column ki jaga 1 or fifth k name sy column enter kr dy ga or main sari values first wali copy kr dy aga
d

In [ ]:
#Conditional statements
d["third"] =d["first"]<d["second"] 
d #its check the whole first column from the second column

# Dictionary without series

In [174]:
dictionary1 = [{"ahmed" : 22 , "ali" : 21 , "sania" : 25} , {"bilal" : 28 , "sania"  : 1 ,  "ayan" : 1} ,{"shani" : 20 , "faizi" : 20 , "mehmish" : 18} ]
dictionary1

[{'ahmed': 22, 'ali': 21, 'sania': 25},
 {'bilal': 28, 'sania': 1, 'ayan': 1},
 {'shani': 20, 'faizi': 20, 'mehmish': 18}]

In [175]:
df = pd.DataFrame(dictionary1)
df

   ahmed   ali  sania  bilal  ayan  shani  faizi  mehmish
0   22.0  21.0   25.0    NaN   NaN    NaN    NaN      NaN
1    NaN   NaN    1.0   28.0   1.0    NaN    NaN      NaN
2    NaN   NaN    NaN    NaN   NaN   20.0   20.0     18.0

In [178]:
pd.DataFrame(df , index = ["mama" , "taya" , "phupoo"])  #hum apni marzi sy B index dy sakty hain nai to by default 0 1 2 hoty hain
df

   ahmed   ali  sania  bilal  ayan  shani  faizi  mehmish
0   22.0  21.0   25.0    NaN   NaN    NaN    NaN      NaN
1    NaN   NaN    1.0   28.0   1.0    NaN    NaN      NaN
2    NaN   NaN    NaN    NaN   NaN   20.0   20.0     18.0

In [183]:
pd.DataFrame(df , columns = ["ali" , "shani" ,"ayan"])  # hum apni marzi k columns ka data B access kr sakty hain

    ali  shani  ayan
0  21.0    NaN   NaN
1   NaN    NaN   1.0
2   NaN   20.0   NaN